Revit 2024 API
BuiltInFailures.SketchFailures.SketchingInWrongView Property
 Detail sketch is not editable in this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SketchingInWrongView { get; }
Visual Basic
Public Shared ReadOnly Property SketchingInWrongView As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SketchingInWrongView {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace